In [1]:
import numpy as np
import pandas as pd

<b>1. Load original data

In [2]:
file1 = pd.read_csv('Data/file1.csv')
file2 = pd.read_csv('Data/file2.csv')
file3 = pd.read_csv('Data/file3.csv')

In [3]:
list(file1.columns)

['Customer',
 'ST',
 'GENDER',
 'Education',
 'Customer Lifetime Value',
 'Income',
 'Monthly Premium Auto',
 'Number of Open Complaints',
 'Policy Type',
 'Vehicle Class',
 'Total Claim Amount']

In [4]:
list(file2.columns)

['Customer',
 'ST',
 'GENDER',
 'Education',
 'Customer Lifetime Value',
 'Income',
 'Monthly Premium Auto',
 'Number of Open Complaints',
 'Total Claim Amount',
 'Policy Type',
 'Vehicle Class']

In [5]:
list(file3.columns)

['Customer',
 'State',
 'Customer Lifetime Value',
 'Education',
 'Gender',
 'Income',
 'Monthly Premium Auto',
 'Number of Open Complaints',
 'Policy Type',
 'Total Claim Amount',
 'Vehicle Class']

<b> 2. As the columns are not ordered same, and upper/lower case differs we need to unify them first before concat.

<b>2.1. change header to lower case for all 3 lists

In [6]:
# Standardizing header names
cols = []
for i in range(len(file1.columns)):
    cols.append(file1.columns[i].lower())
list(cols)

['customer',
 'st',
 'gender',
 'education',
 'customer lifetime value',
 'income',
 'monthly premium auto',
 'number of open complaints',
 'policy type',
 'vehicle class',
 'total claim amount']

In [7]:
file1.columns = cols

In [8]:
file1

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [9]:
cols = []
for i in range(len(file2.columns)):
    cols.append(file2.columns[i].lower())
list(cols)

['customer',
 'st',
 'gender',
 'education',
 'customer lifetime value',
 'income',
 'monthly premium auto',
 'number of open complaints',
 'total claim amount',
 'policy type',
 'vehicle class']

In [10]:
file2.columns = cols

In [11]:
file2

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,total claim amount,policy type,vehicle class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.600000,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.200000,Special Auto,SUV
2,MY31220,California,F,College,899704.02%,54230,112,1/0/00,537.600000,Personal Auto,Two-Door Car
3,UH35128,Oregon,F,College,2580706.30%,71210,214,1/1/00,1027.200000,Personal Auto,Luxury Car
4,WH52799,Arizona,F,College,380812.21%,94903,94,1/0/00,451.200000,Corporate Auto,Two-Door Car
...,...,...,...,...,...,...,...,...,...,...,...
991,HV85198,Arizona,M,Master,847141.75%,63513,70,1/0/00,185.667213,Personal Auto,Four-Door Car
992,BS91566,Arizona,F,College,543121.91%,58161,68,1/0/00,140.747286,Corporate Auto,Four-Door Car
993,IL40123,Nevada,F,College,568964.41%,83640,70,1/0/00,471.050488,Corporate Auto,Two-Door Car
994,MY32149,California,F,Master,368672.38%,0,96,1/0/00,28.460568,Personal Auto,Two-Door Car
995,SA91515,California,M,Bachelor,399258.39%,0,111,1/0/00,700.349052,Personal Auto,SUV

In [12]:
cols = []
for i in range(len(file3.columns)):
    cols.append(file3.columns[i].lower())
list(cols)

['customer',
 'state',
 'customer lifetime value',
 'education',
 'gender',
 'income',
 'monthly premium auto',
 'number of open complaints',
 'policy type',
 'total claim amount',
 'vehicle class']

In [13]:
file3.columns = cols
file3

,customer,state,customer lifetime value,education,gender,income,monthly premium auto,number of open complaints,policy type,total claim amount,vehicle class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car
3,KX23516,California,4455.843406,High School or Below,F,0,121,0,Personal Auto,699.615192,SUV
4,FN77294,California,7704.958480,High School or Below,M,30366,101,2,Personal Auto,484.800000,SUV
...,...,...,...,...,...,...,...,...,...,...,...
7065,LA72316,California,23405.987980,Bachelor,M,71941,73,0,Personal Auto,198.234764,Four-Door Car
7066,PK87824,California,3096.511217,College,F,21604,79,0,Corporate Auto,379.200000,Four-Door Car
7067,TD14365,California,8163.890428,Bachelor,M,0,85,3,Corporate Auto,790.784983,Four-Door Car
7068,UP19263,California,7524.442436,College,M,21941,96,0,Personal Auto,691.200000,Four-Door Car
7069,Y167826,California,2611.836866,College,M,0,77,0,Corporate Auto,369.600000,Two-Door Car

<b>2.2. now use header order of file1 also for file2 and file3

In [14]:
# as standard order we use order of file1

file2 = file2[[
'customer',
 'st',
 'gender',
 'education',
 'customer lifetime value',
 'income',
 'monthly premium auto',
 'number of open complaints',
 'policy type',
 'vehicle class',
 'total claim amount']]

list(file2.columns)

['customer',
 'st',
 'gender',
 'education',
 'customer lifetime value',
 'income',
 'monthly premium auto',
 'number of open complaints',
 'policy type',
 'vehicle class',
 'total claim amount']

<b>2.3 Re-naming header of file3 to align it with file1

In [15]:
file3 = file3.rename(columns={ 'state':'st'})

In [16]:
list(file3.columns)

['customer',
 'st',
 'customer lifetime value',
 'education',
 'gender',
 'income',
 'monthly premium auto',
 'number of open complaints',
 'policy type',
 'total claim amount',
 'vehicle class']

In [17]:
file3 = file3[[
 'customer',
 'st',
 'gender',
 'education',
 'customer lifetime value',
 'income',
 'monthly premium auto',
 'number of open complaints',
 'policy type',
 'vehicle class',
 'total claim amount']]

list(file3.columns)

['customer',
 'st',
 'gender',
 'education',
 'customer lifetime value',
 'income',
 'monthly premium auto',
 'number of open complaints',
 'policy type',
 'vehicle class',
 'total claim amount']

<b>3. Concat the file1, file2 and file3 and save as dataframe

In [18]:
cs_df = pd.concat([file1,file2,file3], axis=0) # axis=0 bcos you want to concat row-wise
cs_df

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
7065,LA72316,California,M,Bachelor,23405.98798,71941.0,73.0,0,Personal Auto,Four-Door Car,198.234764
7066,PK87824,California,F,College,3096.511217,21604.0,79.0,0,Corporate Auto,Four-Door Car,379.200000
7067,TD14365,California,M,Bachelor,8163.890428,0.0,85.0,3,Corporate Auto,Four-Door Car,790.784983
7068,UP19263,California,M,College,7524.442436,21941.0,96.0,0,Personal Auto,Four-Door Car,691.200000
7069,Y167826,California,M,College,2611.836866,0.0,77.0,0,Corporate Auto,Two-Door Car,369.600000

<b>3.1 Re-name header of DF (removing spaces)

In [19]:
cs_df = cs_df.rename(columns={'st':'state','customer lifetime value':'customer_lifetime_value','monthly premium auto':'monthly_premium_auto','number of open complaints':'number_of_open_complaints','policy type':'policy_type','vehicle class':'vehicle_class','total claim amount':'total_claim_amount'})
cs_df

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
7065,LA72316,California,M,Bachelor,23405.98798,71941.0,73.0,0,Personal Auto,Four-Door Car,198.234764
7066,PK87824,California,F,College,3096.511217,21604.0,79.0,0,Corporate Auto,Four-Door Car,379.200000
7067,TD14365,California,M,Bachelor,8163.890428,0.0,85.0,3,Corporate Auto,Four-Door Car,790.784983
7068,UP19263,California,M,College,7524.442436,21941.0,96.0,0,Personal Auto,Four-Door Car,691.200000
7069,Y167826,California,M,College,2611.836866,0.0,77.0,0,Corporate Auto,Two-Door Car,369.600000

<b>4. Deleting and rearranging columns – delete the column customer as it is only a unique identifier for each row of data

In [20]:
cs_df.drop(columns=["customer"], inplace=True)

In [21]:
cs_df

,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...
7065,California,M,Bachelor,23405.98798,71941.0,73.0,0,Personal Auto,Four-Door Car,198.234764
7066,California,F,College,3096.511217,21604.0,79.0,0,Corporate Auto,Four-Door Car,379.200000
7067,California,M,Bachelor,8163.890428,0.0,85.0,3,Corporate Auto,Four-Door Car,790.784983
7068,California,M,College,7524.442436,21941.0,96.0,0,Personal Auto,Four-Door Car,691.200000
7069,California,M,College,2611.836866,0.0,77.0,0,Corporate Auto,Two-Door Car,369.600000

<b>5. Working with data types – Check the data types of all the columns and fix the incorrect ones (for ex. customer lifetime value and number of complaints )

In [22]:
cs_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12074 entries, 0 to 7069
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   state                      9137 non-null   object
 1   gender                     9015 non-null   object
 2   education                  9137 non-null   object
 3   customer_lifetime_value    9130 non-null   object
 4   income                     9137 non-null   float64
 5   monthly_premium_auto       9137 non-null   float64
 6   number_of_open_complaints  9137 non-null   object
 7   policy_type                9137 non-null   object
 8   vehicle_class              9137 non-null   object
 9   total_claim_amount         9137 non-null   float64
dtypes: float64(3), object(7)
memory usage: 1.0+ MB

In [23]:
cs_df._get_numeric_data()

       income  monthly_premium_auto  total_claim_amount
0         0.0                1000.0            2.704934
1         0.0                  94.0         1131.464935
2     48767.0                 108.0          566.472247
3         0.0                 106.0          529.881344
4     36357.0                  68.0           17.269323
...       ...                   ...                 ...
7065  71941.0                  73.0          198.234764
7066  21604.0                  79.0          379.200000
7067      0.0                  85.0          790.784983
7068  21941.0                  96.0          691.200000
7069      0.0                  77.0          369.600000

[12074 rows x 3 columns]

<b>5.1 Clean 'customer_lifetime_value' column

In [24]:
# show all unique items of the column 'customer_lifetime_value'
# here we need to remove the '%' char to convert it into float

cs_df['customer_lifetime_value'].unique()

array([nan, '697953.59%', '1288743.17%', ..., 8163.890428, 7524.442436,
       2611.836866], dtype=object)

In [25]:
# removing the '%' char with 'str.rstrip' right-strip/strip named chars from right

cs_df['customer_lifetime_value'] = cs_df['customer_lifetime_value'].str.rstrip('%')

In [26]:
# checking
cs_df['customer_lifetime_value'].unique()

array([nan, '697953.59', '1288743.17', ..., '568964.41', '368672.38',
       '399258.39'], dtype=object)

<b>5.2 Clean 'number_of_open_complaints' column

In [27]:
# show all unique items of the column 'number_of_open_complaints'
# here we need to convert the 'date-like' fields into an integer by cutting the beginning and the end > '1/| 3 |/00'

cs_df['number_of_open_complaints'].unique()

array(['1/0/00', '1/2/00', '1/1/00', '1/3/00', '1/5/00', '1/4/00', nan, 0,
       2, 3, 1, 5, 4], dtype=object)

In [28]:
# removing the '00' with 'str.rstrip' right-strip
 
cs_df['number_of_open_complaints'] = cs_df['number_of_open_complaints'].str.rstrip('00')

In [29]:
# remove '1' with "Left-Strip" (.str.lstrip)

cs_df['number_of_open_complaints'] = cs_df['number_of_open_complaints'].str.lstrip('1')

In [30]:
# and remove '/' with 'str.strip' (removes characters from start and end)

cs_df['number_of_open_complaints'] = cs_df['number_of_open_complaints'].str.strip('/')

In [31]:
# now data looks fine YEAYY! :D 

cs_df['number_of_open_complaints'].unique()

array(['0', '2', '1', '3', '5', '4', nan], dtype=object)

In [32]:
cs_df['number_of_open_complaints'].value_counts()

0    1626
1     247
2      93
3      60
4      29
5      12
Name: number_of_open_complaints, dtype: int64

<b>5.3 Change type of the two columns to numeric and replace corrupted fields with NaN/NULL

In [33]:
# nonetheless these 2 columns are still NOT numreric hence we need to adjust them accordingly to be able to calculate with them
# with pd.to_numeric we convert them into a numreric field and with 'errors='coerce' we replace all errors with NaN/NULL

cs_df['customer_lifetime_value'] =  pd.to_numeric(cs_df['customer_lifetime_value'], errors='coerce')
cs_df['number_of_open_complaints'] =  pd.to_numeric(cs_df['number_of_open_complaints'], errors='coerce')

In [34]:
# now the type for them is float64 too
cs_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12074 entries, 0 to 7069
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   state                      9137 non-null   object
 1   gender                     9015 non-null   object
 2   education                  9137 non-null   object
 3   customer_lifetime_value    2060 non-null   float64
 4   income                     9137 non-null   float64
 5   monthly_premium_auto       9137 non-null   float64
 6   number_of_open_complaints  2067 non-null   float64
 7   policy_type                9137 non-null   object
 8   vehicle_class              9137 non-null   object
 9   total_claim_amount         9137 non-null   float64
dtypes: float64(5), object(5)
memory usage: 1.0+ MB

In [35]:
# and corrupted fields were replaced with NaN
cs_df

,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,Washington,NaN,Master,NaN,0.0,1000.0,0.0,Personal Auto,Four-Door Car,2.704934
1,Arizona,F,Bachelor,697953.59,0.0,94.0,0.0,Personal Auto,Four-Door Car,1131.464935
2,Nevada,F,Bachelor,1288743.17,48767.0,108.0,0.0,Personal Auto,Two-Door Car,566.472247
3,California,M,Bachelor,764586.18,0.0,106.0,0.0,Corporate Auto,SUV,529.881344
4,Washington,M,High School or Below,536307.65,36357.0,68.0,0.0,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...
7065,California,M,Bachelor,NaN,71941.0,73.0,NaN,Personal Auto,Four-Door Car,198.234764
7066,California,F,College,NaN,21604.0,79.0,NaN,Corporate Auto,Four-Door Car,379.200000
7067,California,M,Bachelor,NaN,0.0,85.0,NaN,Corporate Auto,Four-Door Car,790.784983
7068,California,M,College,NaN,21941.0,96.0,NaN,Personal Auto,Four-Door Car,691.200000
7069,California,M,College,NaN,0.0,77.0,NaN,Corporate Auto,Two-Door Car,369.600000

<b>6. Filtering data and Correcting typos – Filter the data in state and gender column to standardize the texts in those columns

<b>6.1 Cleaning 'gender' column

In [36]:
# there are different expressions for 'male' and 'female' in this column

cs_df['gender'].value_counts()

F         4560
M         4368
Male        40
female      30
Femal       17
Name: gender, dtype: int64

In [37]:
# also a number of missing values (NaN/NULL)

len(cs_df[cs_df['gender'].isna()==True])

3059

In [38]:
# define function to set 'M'/'MALE' to 'Male', 'F','female','Femal' to 'Female' and all blanks(NaN) to 'Unknown'

def clean_gender(x):
    if x in ['M', 'MALE']:
        return 'Male'
    elif x in ['F', 'Femal','female']:
        return 'Female'
    else:
        return 'Unknown'

In [39]:
cs_df['gender'] = list(map(clean_gender, cs_df['gender'])) # execute function to apply changes

In [40]:
# checking new unique entries for 'gender' column
cs_df.gender.unique()

array(['Unknown', 'Female', 'Male'], dtype=object)

In [41]:
# check values again

cs_df['gender'].value_counts()

Female     4607
Male       4368
Unknown    3099
Name: gender, dtype: int64

<b>6.2 Cleaning 'state' column

In [42]:
# checking new unique entries for 'state' column
cs_df.state.unique()

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon', 'Cali',
       'AZ', 'WA', nan], dtype=object)

In [43]:
cs_df['state'].value_counts()

California    3032
Oregon        2601
Arizona       1630
Nevada         882
Washington     768
Cali           120
AZ              74
WA              30
Name: state, dtype: int64

In [44]:
len(cs_df[cs_df['state'].isna()==True]) # number of missing (NaN/NULL) values

2937

In [45]:
# In order to use replace function we first need to fill all NaN/NULL fields with a value. Here we use 'Unknown' 

cs_df['state'] = cs_df['state'].fillna('Unknown')

In [46]:
# check again values

cs_df['state'].value_counts()

California    3032
Unknown       2937
Oregon        2601
Arizona       1630
Nevada         882
Washington     768
Cali           120
AZ              74
WA              30
Name: state, dtype: int64

In [47]:
# define function to set 'WA' to 'Washington', 'AZ' to 'Arizona' and 'Cali' to 'California' and keep all the others as they are

def clean_state(x):
    if x.startswith('Cali'):
        return 'California'
    elif x in ['Oregon']:
        return 'Oregon'
    elif x.startswith('AZ'):
        return 'Arizona'
    elif x in ['Nevada']:
        return 'Nevada'
    elif x.startswith('W'):
        return 'Washington'
    elif x in ['Unknown']:
        return 'Unknown'

In [48]:
cs_df['state'] = list(map(clean_state, cs_df['state'])) # execute function to apply changes

In [49]:
# checking again values

cs_df['state'].value_counts()

California    3152
Unknown       2937
Oregon        2601
Nevada         882
Washington     798
Arizona         74
Name: state, dtype: int64

<b>6.3 Cleaning 'education' column

In [50]:
# there are 2 different expressions for Bachelor in this column

cs_df['education'].value_counts()

Bachelor                2719
College                 2682
High School or Below    2616
Master                   752
Doctor                   344
Bachelors                 24
Name: education, dtype: int64

In [51]:
cs_df.education.unique()

array(['Master', 'Bachelor', 'High School or Below', 'College',
       'Bachelors', 'Doctor', nan], dtype=object)

In [52]:
len(cs_df[cs_df['education'].isna()==True]) # number of missing (NaN/NULL) values

2937

In [53]:
# replace 'Bachelors' with 'Bachelor' with 'str.replace(old, new, [count])'
# regex: bool, default True
 # Determines if the passed-in pattern is a regular expression:
 # If True, assumes the passed-in pattern is a regular expression.
 # If False, treats the pattern as a literal string
 # Cannot be set to False if pat is a compiled regex or repl is a callable.

cs_df['education'] = cs_df['education'].str.replace('Bachelors', 'Bachelor', regex=False)

In [54]:
# check values again

cs_df['education'].value_counts()

Bachelor                2743
College                 2682
High School or Below    2616
Master                   752
Doctor                   344
Name: education, dtype: int64

<b>8. Removing duplicates

In [55]:
# We can remove duplicate rows with the method drop_duplicates()

cs_df = cs_df.drop_duplicates()

In [56]:
cs_df

,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,Washington,Unknown,Master,NaN,0.0,1000.0,0.0,Personal Auto,Four-Door Car,2.704934
1,None,Female,Bachelor,697953.59,0.0,94.0,0.0,Personal Auto,Four-Door Car,1131.464935
2,Nevada,Female,Bachelor,1288743.17,48767.0,108.0,0.0,Personal Auto,Two-Door Car,566.472247
3,California,Male,Bachelor,764586.18,0.0,106.0,0.0,Corporate Auto,SUV,529.881344
4,Washington,Male,High School or Below,536307.65,36357.0,68.0,0.0,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...
7065,California,Male,Bachelor,NaN,71941.0,73.0,NaN,Personal Auto,Four-Door Car,198.234764
7066,California,Female,College,NaN,21604.0,79.0,NaN,Corporate Auto,Four-Door Car,379.200000
7067,California,Male,Bachelor,NaN,0.0,85.0,NaN,Corporate Auto,Four-Door Car,790.784983
7068,California,Male,College,NaN,21941.0,96.0,NaN,Personal Auto,Four-Door Car,691.200000
7069,California,Male,College,NaN,0.0,77.0,NaN,Corporate Auto,Two-Door Car,369.600000

<b>9. Replacing null values – Replace missing values with means of the column (for numerical columns)

In [57]:
# shows the percentage of null values in a column

round(cs_df.isna().sum()/len(cs_df),4)*100

state                        17.99
gender                        0.00
education                     0.01
customer_lifetime_value      76.87
income                        0.01
monthly_premium_auto          0.01
number_of_open_complaints    76.79
policy_type                   0.01
vehicle_class                 0.01
total_claim_amount            0.01
dtype: float64